---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireTypeSet
source: html/4cd0b254-674b-e605-89e3-a016d586f535.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSet

A set that contains wire types.

## Syntax (C#)
```csharp
public class WireTypeSet : APIObject,
	IEnumerable
```